Repository: Krystian137/Resume
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: pl

source: Use the calculator without the need for an account.
pl: Używaj kalkulatora bez zakładania konta.

source: My friends and I used to play a lot of Counter-Strike 2, and during that time we purchased various in-game cases, which could later be sold for profit. I wanted to create a platform where we could track the value of our inventories, monitor price changes over time, and determine the best moment to sell. This project also served as a valuable opportunity for me to improve my development skills and learn new technologies.
pl: Moi znajomi i ja graliśmy intensywnie w Counter-Strike 2, podczas czego kupowaliśmy różne skrzynki w grze, które później można było sprzedać z zyskiem. Chciałem stworzyć platformę, która pozwalałaby nam śledzić wartość naszych ekwipunków, monitorować zmiany cen w czasie oraz określać najlepszy moment na sprzedaż. Projekt był również cenną okazją do rozwijania umiejętności programistycznych i poznawania nowych technologii.

source: This web application was developed using the
pl: Ta aplikacja webowa została stworzona z użyciem

source: framework and provides tools for tracking the prices of CS2 in-game cases listed on the Steam market. Users can view historical price charts, monitor daily, weekly, monthly, and total value changes, and create accounts to manage their personal inventories. The system automatically calculates the total value of owned cases and visualizes market trends to help identify optimal selling moments.
pl: framework i udostępnia narzędzia do śledzenia cen skrzynek z gry CS2 wystawionych na rynku Steam. Użytkownicy mogą przeglądać historyczne wykresy cen, monitorować dzienne, tygodniowe, miesięczne oraz całkowite zmiany wartości, a także zakładać konta w celu zarządzania własnym ekwipunkiem. System automatycznie oblicza łączną wartość posiadanych skrzynek i wizualizuje trendy rynkowe, aby pomóc w identyfikacji optymalnych momentów sprzedaży.

source: Technologies Used
pl: Użyte technologie

source: Charts:
pl: Wykresy:

source: User Authentication
pl: Uwierzytelnianie użytkowników

source: Secure registration, login, and password hashing
pl: Bezpieczna rejestracja, logowanie, oraz hashowanie hasła

source: Inventory Forms
pl: Formularze ekwipunku

source: Manage case quantities and view value changes
pl: Zarządzaj ilością skrzyń i sprawdzaj ich zmianę wartości

source: Daily Updates
pl: Codzienne aktualizacje

source: Automated updates using GitHub Actions
pl: Automatyczne aktualizacje z użyciem GitHub Actions

source: Git Integration
pl: Integracja z Git

source: Version control and GitHub hosting
pl: Kontrola wersji i hostowanie na GitHubie

source: Full-Stack Project
pl: Projekt Full-Stack

source: Real-world stack for modern web apps
pl: Praktyczny stack technologiczny dla współczesnych aplikacji internetowych

source: Case Value Charts
pl: Wykres wartości skrzyni

source: Visualize price fluctuations over time
pl: Wizualizacja zmiany cen w czasie

source: The homepage displays a dynamically generated list of all Counter-Strike 2 cases available on the Steam Market, each represented by a card containing the case name, image fetched from the Steam API, and market price.
pl: Strona główna wyświetla dynamicznie generowaną listę wszystkich skrzynek z gry Counter-Strike 2 dostępnych na rynku Steam, z których każda jest przedstawiona jako karta zawierająca nazwę skrzynki, obraz pobrany z marketplace Steam oraz cenę rynkową pobraną z API.

source: Clicking on a case redirects the user to a detailed subpage showing a historical price chart and metadata.
pl: Wybranie skrzyni przenosi na podstronę z jej detalami, takimi jak wykres zmian ceny w czasie.

source: Data is regularly fetched and stored in JSON format as part of my learning process with JSON handling.
pl: Dane są regularnie pobierane i przechowywane w formacie JSON, jako proces mojej nauki z tym formatem.

source: To improve performance, I created a separate JSON file that stores only the latest prices for each case.
pl: Dla optymalizacji strony głównej utworzyłem dodatkowy plik JSON zawierający tylko najnowsze ceny.

source: Steam Chests Overview
pl: Podgląd skrzyń

source: The user dashboard enables authenticated users to input and manage their owned Counter-Strike 2 cases along with quantities.
pl: Panel użytkownika umożliwia zalogowanym użytkownikom wprowadzanie i zarządzanie posiadanymi skrzynkami z gry Counter-Strike 2 wraz z ich ilościami.

source: Each entry is displayed in a dynamic, responsive table that includes the case’s latest market price, total value (with and without Steam transaction fees), and percentage change from the previous day.
pl: Każdy wpis jest wyświetlany w dynamicznej, responsywnej tabeli, która zawiera najnowszą cenę rynkową skrzynki, łączną wartość (z uwzględnieniem i bez uwzględnienia opłat transakcyjnych Steam) oraz procentową zmianę względem poprzedniego dnia, tygodnia, miesiąca, oraz łączną.

source: Users can update or remove individual case records.
pl: Użytkownicy mogą edytować swój stan ekwipunku.

source: Below the table, the application calculates and displays the cumulative value of all listed cases, both pre- and post-tax.
pl: Poniżej tabeli aplikacja oblicza i wyświetla łączną wartość wszystkich wymienionych skrzynek - zarówno przed opodatkowaniem, jak i po jego uwzględnieniu.

source: User Inventory Page
pl: Ekwipunek Użytkownika

source: The chest detail page presents an interactive price history chart powered by Chart.js, allowing users to analyze case price fluctuations over various time ranges, including the past week, month, year, and all-time.
pl: Strona szczegółów skrzynki prezentuje interaktywny wykres historii cen oparty na Chart.js, umożliwiający użytkownikom analizę wahań cen skrzynki w różnych przedziałach czasowych -w tym z ostatniego tygodnia, miesiąca, roku oraz całego okresu.

source: Users can dynamically select the desired time frame.
pl: Użytkownicy mogą dynamicznie wybierać preferowany przedział czasowy.

source: Below the chart, a data table displays historical prices by date along with the corresponding percentage change compared to the previous recorded value.
pl: Poniżej wykresu znajduje się tabela danych, która wyświetla historyczne ceny według daty wraz z odpowiadającą im procentową zmianą względem poprzednio zarejestrowanej wartości.

source: Chest Detail Page
pl: Strona szczegółów skrzynki

source: The calculator is designed for users who prefer not to create an account.
pl: Kalkulator został zaprojektowany z myślą o użytkownikach, którzy wolą nie zakładać konta.

source: It offers similar functionality to the user inventory page, allowing users to input the cases they own and their respective quantities.
pl: Oferuje podobną funkcjonalność do strony ekwipunku użytkownika, umożliwiając wprowadzanie posiadanych skrzynek oraz ich ilości.

source: However, it does not persist any data — once the session ends or the page is refreshed, all information is cleared.
pl: Jednak dane nie są zapisywane — po zakończeniu sesji lub odświeżeniu strony wszystkie informacje zostają usunięte.

source: This tool provides a quick way to estimate the total value of owned cases, both before and after Steam transaction fees.
pl: To narzędzie umożliwia szybkie oszacowanie łącznej wartości posiadanych skrzynek — zarówno przed, jak i po uwzględnieniu opłat transakcyjnych Steam.

source: Calculator Tool
pl: Kalkulator

source: The project includes a secure user authentication system featuring user registration and login functionality.
pl: Projekt zawiera bezpieczny system uwierzytelniania użytkowników, obejmujący funkcjonalność rejestracji oraz logowania.

source: During registration, user credentials are validated and passwords are securely hashed using industry-standard techniques before being stored in the database.
pl: Podczas rejestracji dane uwierzytelniające użytkownika są weryfikowane, a hasła bezpiecznie haszowane z wykorzystaniem technik zgodnych ze standardami branżowymi, zanim zostaną zapisane w bazie danych.

source: Upon logging in, users gain access to personalized features such as managing their own case inventory.
pl: Po zalogowaniu użytkownicy uzyskują dostęp do spersonalizowanych funkcji, takich jak zarządzanie własnym ekwipunkiem skrzynek.

source: Session management is handled via Flask’s session mechanism to maintain user state throughout the visit.
pl: Zarządzanie sesją odbywa się za pomocą mechanizmu sesji Flask, co pozwala na utrzymanie stanu użytkownika przez cały czas trwania wizyty.

source: Login and Registration
pl: Logowanie i rejestracja
