Repository: Krystian137/Resume
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: pl

source: — including title, release year, genres, director, writer, poster, rating, and overview.
pl: — zawierające tytuł, datę premiery gatunek, reżyser, scenarzysta, plakat, ocenę, oraz opis.

source: Before final submission, the user has the opportunity to
pl: Przed dodaniem filmu na stronę, jest możliwość

source: review and correct the information
pl: przejrzenia i korekcji informacji

source: to ensure accuracy.
pl: w celu zachowania zgodności.

source: Once confirmed, the movie is
pl: Po potwierdzeniu, film jest

source: added to the platform
pl: dodawany na platformę

source: and becomes accessible to all users on the main page and in search results.
pl: oraz staje się dostępny na stronię głównej dla wszystkich użytkowników.

source: Admins
pl: Admini

source: have access to user profile pages in order to
pl: mają dostęp do profili użytkowników w celu

source: monitor user activity
pl: monitorowania aktywności

source: within the comment sections.
pl: w sekcji komentarzy.

source: This includes reviewing all comments posted by a user and assessing their behavior on the platform.
pl: Obejmuje to przegląd wszystkich komentarzy opublikowanych przez użytkownika oraz ocenę jego zachowania na platformie.

source: If necessary, they can
pl: W razie konieczności mają możliwość

source: remove any inappropriate or disruptive comments
pl: usunąć wszelkie niestosowne lub zakłócające komentarze

source: directly from the user’s profile view.
pl: bezpośrednio z poziomu profilu użytkownika.

source: This functionality ensures a
pl: Ta funkcjonalność zapewnia

source: safe and respectful environment
pl: bezpieczne i pełne szacunku środowisko

source: for all users and gives moderators the tools needed to enforce community standards.
pl: dla wszystkich użytkowników, oraz daje moderatorom narzędzia niezbędne do egzekwowania standardów społeczności.

source: Admin and moderator
pl: Admini i moderatorzy

source: have access to a dedicated user management page, where they can view a complete list of registered accounts.
pl: mają dostęp do dedykowanej strony zarządzającej użytkownikami, gdzie znajduje się lista zarejestrowanych kont.

source: From this panel, they can
pl: Z tego panelu, mogą

source: promote or demote user roles
pl: nadawać i odbierać role użytkownikom

source: remove users
pl: usuwać użytkowników

source: from the platform, and
pl: z aplikacji, oraz

source: access individual user profiles
pl: zapewnia dostęp do profili użytkowników

source: to monitor activity or take necessary moderation actions.
pl: w celu monitorowania ich aktywności i ewentualnie podjęcia niezbędnych akcji.

source: This feature provides full control over user administration, ensuring that only trusted members hold higher privileges and that the platform remains well-moderated.
pl: Ta funkcja zapewnia pełną kontrolę nad zarządzaniem użytkownikami, gwarantując, że wyższe uprawnienia otrzymują wyłącznie zaufani członkowie społeczności, a platforma pozostaje odpowiednio moderowana.

source: About Me
pl: O mnie

source: page offers an overview of the
pl: podstrona zawiera przegląd

source: This section is optimized as a
pl: Ta sekcja jest pomyślana jako

source: SEO-friendly subpage
pl: przyjazna SEO podstrona

source: to enhance discoverability and answer common user questions, such as how the site works, where data is sourced from, and who manages content and moderation.
pl: w celu zwiększenia widoczności oraz odpowiedzi na najczęściej zadawane pytania użytkowników, takie jak: jak działa strona, skąd pochodzą dane oraz kto zarządza treściami i moderacją.

source: Contact Me
pl: Skontaktuj się ze mną

source: page provides a direct line of communication for
pl: zapewnia bezpośrednią komunikację dla

source: users and potential collaborators
pl: użytkowników i potencjalnych współpracowników

source: to reach out to the site administrators.
pl: z administracją strony.

source: Whether it's for reporting bugs, sharing feedback, business inquiries, or collaboration proposals, this form allows messages to be sent securely and efficiently via email.
pl: Niezależnie od tego, czy chodzi o zgłoszenie błędów, przekazanie opinii, zapytania biznesowe czy propozycje współpracy — formularz umożliwia bezpieczne i sprawne przesyłanie wiadomości drogą mailową.

source: It reinforces transparency and keeps the community engaged and connected with the development team.
pl: Wzmacnia przejrzystość i utrzymuje zaangażowanie społeczności, zapewniając stały kontakt z zespołem deweloperskim.

source: Both sections are designed to strengthen user trust, provide transparency, and foster community interaction around the project.
pl: Obie sekcje zostały zaprojektowane z myślą o budowaniu zaufania użytkowników, zapewnieniu przejrzystości oraz wspieraniu interakcji społeczności wokół projektu.

source: Login/Register
pl: Logowanie/Rejestracja

source: The platform includes a secure
pl: Platforma zawiera bezpieczne

source: login
pl: logowanie

source: registration
pl: rejestracje

source: system that allows users to create personalized accounts.
pl: pozwalające na założenie własnego profilu nowym użytkownikom.

source: Upon registration, user passwords are
pl: Po zarejestrowaniu hasła są

source: safely hashed
pl: bezpiecznie hashowane

source: before being stored in the database, ensuring data protection and user privacy.
pl: przed zapisaniem ich w bazie danych. w celu zachowania bezpieczeństwa i prywatności użytkowników.

source: Once logged in, users unlock full access to interactive features such as
pl: Po zalogowaniu użytkownicy mają dostęp do funkcji takich jak

source: writing and replying to comments
pl: pisanie i odpowiadanie komentarzy

source: rating movies
pl: ocenianie filmów

source: and voting on the usefulness of other users opinions.
pl: oraz głosowanie za użytecznością komentarzy innych użytkowników.

source: This authentication layer helps maintain the quality of content and fosters meaningful discussions by holding users accountable for their activity.
pl: Ta warstwa uwierzytelniania pomaga utrzymać wysoką jakość treści i sprzyja wartościowym dyskusjom, zapewniając odpowiedzialność użytkowników za ich aktywność.

source: The system lays the groundwork for role-based access control, ensuring that only authenticated users can engage with content and that higher privileges are granted only to moderators and administrators.
pl: System stanowi podstawę do wdrożenia kontroli dostępu opartej na rolach, zapewniając, że tylko uwierzytelnieni użytkownicy mogą wchodzić w interakcję z treściami, a wyższe uprawnienia są przyznawane wyłącznie moderatorom i administratorom.

source: Go back
pl: Powrót

source: Preview
pl: Podgłąd

source: More
pl: Więcej

source: Django Version
pl: Wersja Django

source: Flask Version
pl: Wersja Flask

source: Better site ranking
pl: Lepsze pozycjonowanie strony

source: About me
pl: O mnie

source: Information for other users about author
pl: Informacje dla użytkowników o autorze

source: key details, ratings, and a comment section
pl: kluczowe informacje, oceny, oraz sekcja komentarzy

source: reply
pl: odpowiadanie

source: to other
pl: na

source: comments
pl: komentarze innych

source: with roles:
pl: z rolami:

source: add, edit, or delete movies, manage comments, moderate user profiles
pl: dodaj, edytuj, usuń film, zarządzanie komentarzami, oraz nadzorowanie profilów

source: dynamically manages the content rendering and API data integration to ensure smooth and modern user interaction.
pl: dynamicznie zarządza renderowaniem treści oraz integracją danych z API, zapewniając płynną i nowoczesną interakcję z użytkownikiem.

source: and stored in the
pl: i zapisana w

source: database.
pl: bazie danych.

source: them based on their experience, giving a numerical score that reflects their opinion.
pl: na podstawie własnych doświadczeń, przyznając ocenę liczbową odzwierciedlającą ich opinię.

source: their own comment at any time, providing control over their contributions.
pl: swój własny komentarz w dowolnym momencie, co daje im kontrolę nad własnymi wypowiedziami.

source: This section allows
pl: Ta sekcja pozwala

source: authorized users
pl: autoryzowanym użytkownikom

source: to add new movies to the
pl: aby dodać nowy film na

source: page, where an authorized user can enter a film title into the search bar.
pl: stronę, autoryzowany użytkownik musi podać tytuł filmu w oknie wyszukiwania.

source: A list of matching and similar titles from TMDb API is displayed, allowing the user to
pl: Lista filmów z podobnymi tytułami z TMDb API zostanie wyświetlana, pozwalając na

source: from the results, and add it into web application database.
pl: na podstawie wyników i dodaj do bazy danych aplikacji webowej.

source: Upon selecting a new movie, the user is redirected to a shared interface that also serves as the
pl: Po wybraniu nowego filmu użytkownik zostaje przekierowany do wspólnego interfejsu, który pełni również funkcję

source: page, which is also accessible from home page, and movie page.
pl: podstrony, dostępnej z strony głównej oraz strony filmu.

source: — including title, release year, genres, director, writer, poster, rating, and overview
pl: — w tym tytuł, rok premiery, gatunki, reżyser, scenarzysta, plakat, ocena oraz opis

source: If the user is
pl: Jeżeli użytkownik jest

source: editing
pl: edytowanie

source: an existing movie, the form is pre-filled with its previously stored data, which can then be updated as needed.
pl: w przypadku istniejącego filmu formularz zostaje wstępnie wypełniony wcześniej zapisanymi danymi, które można następnie zaktualizować w razie potrzeby.

source: subpage demonstrates structured content optimization using
pl: podstrona prezentuje optymalizację struktury treści z wykorzystaniem

source: for SEO and accessibility.
pl: z myślą o SEO i dostępności.

source: It includes frequently asked questions about the platform’s features, showcasing a practical understanding of semantic HTML
pl: Zawiera najczęściej zadawane pytania dotyczące funkcji platformy, prezentując praktyczne zastosowanie semantycznego HTML

source: Implemented with Django templates and
pl: Zaimplementowane z Django templates, oraz

source: markup, it improves discoverability while showcasing my focus on usability, accessibility, and web performance.
pl: znaczniki HTML poprawiają wykrywalność treści, jednocześnie podkreślając moje podejście do użyteczności, dostępności i wydajności strony.

source: for all users and gives moderators the tools needed to enforce community standards.
pl: dla wszystkich użytkowników, zapewniając moderatorom narzędzia niezbędne do egzekwowania zasad społeczności.

source: to monitor activity or take necessary moderation actions.
pl: aby monitorować aktywność lub podejmować niezbędne działania.

source: project – a web application for discovering and reviewing movies.
pl: projekt – aplikacja webowa do odkrywania i recenzowania filmów.

source: It can also serve as a
pl: Może służyć także jako

source: regulations or policy page
pl: zakładka „Regulamin i polityka prywatności”

source: offering users important information about the platform.
pl: udostępniając użytkownikom istotne informacje o platformie.

source: Section is designed to strengthen
pl: Celem tej sekcji jest wzmocnienie

source: user trust, provide transparency, and foster community interaction
pl: zaufanie użytkowników, zapewnienie przejrzystości oraz wspiera interakcje społeczności

source: around the project.
pl: wokół projektu.

source: voting
pl: ocenianie

source: on the usefulness of other users opinions.
pl: użyteczności opinii innych użytkowników.

source: made in flask
pl: stworzony we flasku

source: Memory game: type U.S. states to fill the map
pl: Gra pamięciowa: wpisz nazwy stanów w USA

source: built in Python using Turtle and Pandas
pl: stworzona w Pyton z użyciem Turtle oraz Pandas

source: in Python with Turtle
pl: w Pyton z użyciem Turtle

source: Cross a road as a turtle
pl: Przejdź przez drogę jako żółw

source: A simple terminal game that tests your knowledge
pl: Prosta gra w terminalu do sprawdzania wiedzy

source: Fetches price data from external APIs
pl: Pobiera dane cenowe z zewnętrznego interfejsu API

source: An automation bot that plays Cookie Clicker using Selenium
pl: Zautomatyzowany bot, który gra w Cookie Clicker z użyciem Selenium

source: Generates Spotify playlists from Billboard Hot 100 charts
pl: Tworzy playlistę na platformę Spotify w oparciu o Billboard Hot 100

source: Why I made this projects?
pl: Motywacja stojąca za projektami

source: I created these projects as a way to learn through practice.
pl: Stworzyłem te projekty w formie praktycznej nauki.

source: Building games, apps, and tools allowed me to apply concepts like
pl: Tworzenie gier, aplikacji i narzędzi pozwoliło mi zastosować w praktyce takie koncepcje jak

source: working with APIs
pl: praca z API

source: data management
pl: zarządzanie danymi

source: user interface development
pl: tworzenie interfejsu użytkownika

source: in real scenarios.
pl: w praktyce.

source: Each project helped me grow both technically and creatively, and gave me a better understanding of how to connect different technologies into complete, functional solutions.
pl: Każdy projekt pozwolił mi rozwijać się zarówno technicznie, jak i kreatywnie, a także lepiej zrozumieć, jak łączyć różne technologie w kompletne, funkcjonalne rozwiązania.

source: This hands-on approach has been the most effective way for me to develop as a programmer.
pl: Podejście oparte na praktyce okazało się dla mnie najskuteczniejszym sposobem rozwoju jako programisty.

source: All Projects
pl: Projekty

source: A modern take on the classic Snake game – built with
pl: Współczesne podejście do kultowej gry Snake – stworzone przy użyciu

source: The game features multiple difficulty levels, a nickname-based scoring system, and local score saving using
pl: Gra oferuje kilka poziomów trudności, system punktacji, pseudonimy graczy, oraz lokalne zapisywanie wyników przy użyciu

source: JSON-based database
pl: bazy danych stworzonej na JSON

source: All gameplay logic runs entirely in the browser, providing a smooth and responsive experience.
pl: Cała logika rozgrywki działa w przeglądarce, zapewniając płynne i responsywne działanie.

source: Players can compete for a spot in the top 10 leaderboard.
pl: Gracze mogą rywalizować o miejsce w pierwszej 10 najlepszych wyników.

source: The project also demonstrates full integration between the frontend and a lightweight Python backend.
pl: Projekt demonstruje również pełną integrację między front-endem a lekkim back-endem opartym na Pythonie.

source: An interactive geographical quiz built with
pl: Interaktywny geograficzny quiz stworzony w

source: graphics library.
pl: graficznej bibliotece.

source: The goal is to correctly name all 50 U.S. states, which are then dynamically labeled on a blank map.
pl: Celem gry jest poprawne nazwanie wszystkich 50 stanów USA, które następnie są dynamicznie oznaczane na pustej mapie.

source: The application loads and processes a
pl: Aplikacja wczytuje oraz przetwarza

source: CSV file
pl: plik CVS

source: containing state names and their coordinates, and uses
pl: zawierający nazwy stanów razem z ich koordynatami, oraz używa

source: to manage data input, filtering, and output.
pl: do przetwarzania, filtrowania i prezentacji danych.

source: If the player chooses to exit early, the program automatically generates a new CSV file -
pl: Jeśli gracz zdecyduje się zakończyć grę wcześniej, program automatycznie generuje nowy plik CSV –

source: listing the states that were missed, allowing for personalized review and improvement.
pl: zawierający listę pominiętych stanów, co umożliwia spersonalizowany przegląd i dalsze doskonalenie.

source: As a light introduction to data-driven applications, this project demonstrates how basic
pl: Jako lekkie wprowadzenie do aplikacji opartych na danych, projekt pokazuje, jak podstawowe

source: data science tools
pl: narzędzia analityczne

source: can be applied in an interactive and visual context.
pl: można zastosować w interaktywnym i wizualnym kontekście.

source: A modern take on the classic Pong game, developed using
pl: Wersja klasycznej gry Pong – stworzona przy użyciu

source: The project is structured in an object-oriented way, with separate classes for the paddles, ball, and scoreboard.
pl: Projekt ma strukturę obiektową, z oddzielnymi klasami dla paletek, piłki i tablicy wyników.

source: It features real-time input handling for smooth two-player gameplay, dynamic collision detection, score tracking, and a gradually increasing ball speed.
pl: Zawiera obsługę danych wejściowych w czasie rzeczywistym, zapewniając płynną rozgrywkę dla dwóch graczy, dynamiczne wykrywanie kolizji, śledzenie punktacji oraz stopniowo rosnącą prędkość piłki.

source: I built this project as a personal exercise to better understand
pl: Stworzyłem ten projekt jako ćwiczenie własne, aby lepiej zrozumieć

source: basic game mechanics
pl: podstawowe mechaniki gry

source: while experimenting with simple animation and user interaction in Python.
pl: podczas eksperymentowania z prostą animacją i interakcją z użytkownikiem w Pythonie.

source: View on Github
pl: Sprawdź na Github

source: A classic
pl: Klasyczny

source: game built in
pl: stworzony w

source: using the
pl: przy użyciu

source: The project is structured in an object-oriented manner, with separate classes handling the snake's behavior, food spawning, and score keeping.
pl: Projekt ma strukturę obiektową, z oddzielnymi klasami odpowiedzialnymi za zachowanie węża, generowanie jedzenia oraz zarządzanie punktacją.

source: It features real-time input handling, collision detection with walls, food, and the snake’s own body, as well as persistent high score tracking using a local file.
pl: Zawiera obsługę danych wejściowych w czasie rzeczywistym, wykrywanie kolizji ze ścianami, jedzeniem oraz ciałem węża, a także trwałe śledzenie najlepszego wyniku z wykorzystaniem lokalnego pliku.

source: I created this project to strengthen my understanding of
pl: Stworzyłem ten projekt aby zwiększyć moje zrozumienie

source: object-oriented programming
pl: programowania obiektowego

source: collision logic
pl: logika kolizji

source: and working with persistent data.
pl: oraz pracy z danymi trwałymi.

source: Frogger-style game
pl: Gra w stylu Froggera

source: developed in
pl: stworzona w

source: with the
pl: z

source: graphics module.
pl: modułem graficznym.

source: The player controls a turtle trying to cross a busy road without getting hit by randomly generated cars.
pl: Gracz steruje żółwiem, który próbuje przejść przez ruchliwą drogę, unikając losowo generowanych samochodów.

source: Each successful crossing increases the game level and the speed of oncoming traffic, making the game progressively more challenging.
pl: Każde udane przejście zwiększa poziom gry oraz prędkość nadjeżdżających pojazdów, czyniąc rozgrywkę stopniowo coraz trudniejszą.

source: This project helped me improve my skills in
pl: Ten projekt pomógł mi rozwinąć umiejętności w zakresie programowania

source: event-driven programming
pl: opartego na zdarzeniach

source: object-oriented design
pl: projektowanie obiektowe

source: and handling
pl: i obsługi

source: dynamic difficulty scaling
pl: dynamiczne skalowanie poziomu trudności

source: Quiz Game
pl: Gra quizowa

source: A simple
pl: Prosta

source: True/False quiz game
pl: gra Prawda/Fałsz

source: written in
pl: napisana w

source: based on object-oriented programming principles.
pl: oparta na zasadach programowania obiektowego.

source: The questions are pulled from a structured data source and displayed one by one in the terminal.
pl: Pytania są odczytywane ze zorganizowanego źródła danych i prezentowane pojedynczo w terminalu.

source: The game keeps track of the user's score and gives immediate feedback after each answer.
pl: Gra śledzi wynik użytkownika i udziela natychmiastowej informacji zwrotnej po każdej odpowiedzi.

source: This project improved my understanding of
pl: Ten projekt poprawił moje zrozumienie

source: data encapsulation
pl: hermetyzacja danych

source: input validation
pl: sprawdzanie poprawności danych wejściowych

source: managing program state
pl: zarządzanie stanem programu

source: using class instances.
pl: przy użyciu obiektów klas.

source: A data scraping project focused on collecting rental property information (price, address, and link) from a Zillow-like website using BeautifulSoup and Selenium.
pl: Projekt scrapera danych, skoncentrowany na zbieraniu informacji o nieruchomościach na wynajem (cena, adres i link) z serwisu podobnego do Zillow, z wykorzystaniem BeautifulSoup i Selenium.

source: Extracted data is then automatically submitted to a Google Form, simulating data entry automation.
pl: Wyodrębnione dane są następnie automatycznie przesyłane do formularza Google, symulując automatyzację wprowadzania danych.

source: This project demonstrates practical use of web scraping, data parsing, and browser automation - useful skills in data analysis pipelines and web data integration.
pl: Projekt ten pokazuje praktyczne zastosowanie web scrapingu, parsowania danych oraz automatyzacji przeglądarki - umiejętności przydatnych w tworzeniu pipeline’ów analitycznych oraz integracji danych z sieci.

source: A Selenium-based automation project showcasing browser interaction skills through multiple mini-tasks.
pl: Projekt automatyzacji oparty na Selenium, prezentujący umiejętności interakcji z przeglądarką poprzez zestaw różnych mini-zadań.

source: The main focus is a bot for the Cookie Clicker game that automates cookie generation and intelligently purchases upgrades to optimize efficiency.
pl: Automatyzuje zdobywanie ciasteczek oraz inteligentnie kupuje ulepszenia w celu optymalizacji wydajności.

source: Additional scripts demonstrate how to scrape event data from python.org, automate form submissions, and interact with Wikipedia.
pl: Dodatkowe skrypty pokazują, jak pobierać dane o wydarzeniach z python.org, automatyzować wypełnianie formularzy oraz wchodzić w interakcję z Wikipedią.

source: This project highlights practical web automation techniques and real-time decision-making in dynamic web environments.
pl: Projekt podkreśla praktyczne techniki automatyzacji działań w sieci oraz podejmowanie decyzji w czasie rzeczywistym w dynamicznych środowiskach webowych.

source: Built a Python application that scrapes the Billboard Hot 100 chart for a user-specified date (using BeautifulSoup), searches for each track on Spotify via the Spotipy API, and automatically creates a private Spotify playlist with the found songs.
pl: Stworzyłem aplikację w Pythonie, która pobiera listę Billboard Hot 100 dla wskazanej przez użytkownika daty (z użyciem BeautifulSoup), wyszukuje każdy utwór na Spotify za pomocą API Spotipy i automatycznie tworzy prywatną playlistę z odnalezionymi piosenkami.

source: Utilized OAuth for user authentication and integrated data from multiple external sources (Billboard and Spotify APIs).
pl: Wykorzystano OAuth do uwierzytelniania użytkownika oraz zintegrowano dane z kilku zewnętrznych źródeł (API Billboard i Spotify).

source: Chest Page
pl: Strona skrzyni

source: Calculator
pl: Kalkulator

source: Technologies behind it and the idea that started it all
pl: Technologie wykorzystane w projekcie, oraz motywacja

source: Overview of all available cases and their latest prices.
pl: Podgląd wszystkich dostępnych skrzyń z aktualnymi cenami.

source: List of user chests and their price
pl: Lista skrzyń użytkownika z ich wartością

source: Track price history, spot trends, and see percentage changes.
pl: Sprawdź historię wartości, dostrzegaj trendy, zobacz zmiany procentowe.
