Repository: Krystian137/Resume
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: pl

source: Resume
pl: CV

source: Projects
pl: Projekty

source: Contact
pl: Kontakt

source: Hello!
pl: Cześć!

source: I'm IT student (4rd year) with specialization in Web Engineering. Actively working in Python, and back-end development. I'm also exploring data science and enjoy working with datasets and statistical analysis.
pl: Jestem studentem informatyki (4 rok) na specjalizacji Inżynieria internetowa. Pracuje w Pythonie i zajmuję się back-endem, oraz front-endem. Interesuje mnie również analiza danych i lubię pracować z zestawami danych i analizą statystyczną.

source: Technologies
pl: Technologie

source: Technologies I know:
pl: Technologie, które znam:

source: Experience
pl: Doświadczenie

source: Present
pl: Obecnie

source: Responsible for implementing updates and optimizing an existing website, with a focus on maintaining consistency with current design and standards. <br><br> Performed comprehensive diagnostics and independent repairs of computer hardware. Responsible for servicing and maintaining equipment, including troubleshooting and implementing technical solutions to ensure continuous device operation. <br><br> Handled operational support for e-commerce orders, including quality control, order fulfillment, and verification of product accuracy prior to shipment.
pl: Wdrażanie aktualizacji i optymalizacja istniejącej strony internetowej, ze szczególnym uwzględnieniem spójności i standardami. <br><br> Przeprowadzanie kompleksowej diagnostyki oraz samodzielne naprawy sprzętu komputerowego. Serwisowanie i utrzymanie urządzeń, w tym rozwiązywanie problemów technicznych oraz wdrażanie rozwiązań zapewniających ich nieprzerwaną pracę. <br><br> Zajmowałem się operacyjnym wsparciem realizacji zamówień e-commerce, w tym kontrolą jakości, kompletowaniem przesyłek oraz weryfikacją poprawności produktów przed wysyłką.

source: Education
pl: Wykształcenie

source: Wroclaw Business University of Applied Sciences
pl: Wrocławska Akademia Biznesu w Naukach Stosowanych

source: Bachelor of Engineering degree in Computer Science, specializing in Web Engineering. Gained practical knowledge in programming, database design and integration, computer networks, and IT project management. Covered full-stack web development — from front-end technologies and frameworks to back-end solutions and database connectivity. Additional focus on web application documentation, understanding copyright and licensing, and development best practices.
pl: Studia licencjackie na kierunku Informatyka ze specjalizacją Inżynieria Internetowa. Zdobyta wiedza praktyczna z zakresu programowania, projektowania i integracji baz danych, sieci komputerowych oraz zarządzania projektami IT. Program obejmował pełny zakres tworzenia aplikacji webowych — od technologii front-end i frameworków po rozwiązania back-endowe i łączenie z bazami danych. Dodatkowy nacisk położono na dokumentację aplikacji, prawa autorskie i licencje oraz dobre praktyki developerskie.

source: Technical Secondary School No. 1 (Kemal Mustafa Atatürk)
pl: Technikum nr 1 im. Kemala Mustafy Atatürka

source: Specialized in Computer Science with an extended curriculum in Mathematics and Physics. Gained foundational knowledge in databases, computer networks, and server management on both Linux and Windows systems. Learned the basics of programming and web development, including building and maintaining websites. Developed problem-solving skills and a passion for technology.
pl: Kierunek: technik informatyk z rozszerzonym programem matematyki i fizyki. Podstawowa wiedza z zakresu baz danych, sieci komputerowych i zarządzania serwerami w systemach Linux i Windows. Opanowane podstawy programowania i tworzenia stron internetowych. Rozwinięte umiejętności rozwiązywania problemów oraz zamiłowanie do nowych technologii.

source: Additional Programming Courses (junior high school)
pl: Dodatkowe zajęcia z programowania (szkoła podstawowa/gimnazjum)

source: Attended extracurricular programming classes during junior high school. Gained early experience with basic programming, and front-end development.
pl: Uczęszczałem na dodatkowe zajęcia z programowania w gimnazjum, zdobywając wczesne doświadczenie w podstawach programowania oraz tworzeniu front-endu.

source: Courses (Udemy)
pl: Kursy (Udemy)

source: Master Python by Building 100 Projects in 100 Days. Learn Data Science, Automation, Build Websites, Games, and Apps!
pl: Opanuj Pythona, tworząc 100 projektów w 100 dni. Naucz się Data Science, automatyzacji, tworzenia stron, gier i aplikacji!

source: In this comprehensive course, you'll learn Python by working on 100 diverse projects over 100 days. Covering essential topics such as data science, automation, web development, game creation, and app building, this course is designed to help you gain hands-on experience and become proficient in Python. You'll tackle real-world problems, enhance your coding skills, and create a portfolio of projects that showcase your abilities to potential employers or clients.
pl: Kompleksowy kurs Pythona poprzez realizację 100 zróżnicowanych projektów w 100 dni. Zakres obejmuje m.in. data science, automatyzację, tworzenie stron WWW, gier i aplikacji. Kurs nastawiony jest na praktykę — umożliwia rozwój umiejętności kodowania poprzez rozwiązywanie realnych problemów. Efektem końcowym jest bogate portfolio, które można zaprezentować pracodawcy lub klientowi.

source: Become a Full-Stack Web Developer with Just ONE Course: HTML, CSS, JavaScript, Node, React, PostgreSQL, Web3, and DApps
pl: Zostań full-stack developerem dzięki jednemu kursowi: HTML, CSS, JavaScript, Node.js, React, PostgreSQL, Web3 i DApps

source: This all-in-one course is your gateway to becoming a full-stack web developer. Covering a wide array of essential technologies such as HTML, CSS, JavaScript, Node.js, React, and PostgreSQL, you'll gain both front-end and back-end development skills. Learn how to build dynamic, interactive websites and apps, while also diving into modern concepts like Web3 and decentralized applications (DApps). Perfect for those looking to master full-stack development and build real-world projects from scratch.
pl: Kurs typu „wszystko w jednym”, idealny dla osób dążących do zostania full-stack developerem. Obejmuje HTML, CSS, JavaScript, Node.js, React, PostgreSQL oraz zagadnienia związane z Web3 i aplikacjami zdecentralizowanymi (DApps). Uczy budowy dynamicznych i interaktywnych stron oraz aplikacji — od podstaw do gotowych projektów.

source: Build Your First Website from Scratch and Learn the Key Principles of UX
pl: Zbuduj swoją pierwszą stronę od podstaw i poznaj kluczowe zasady UX

source: Basic UX concepts and principles. Drawing inspiration and the first stages of the project. Designing the layout in Photoshop. Coding the HTML structure. Further project stages and working with CSS. Automating the workflow and finalizing the project elements.
pl: Podstawy UX. Inspiracje i pierwsze etapy projektu. Projektowanie układu w Photoshopie. Tworzenie struktury HTML, dalsze etapy z użyciem CSS. Automatyzacja pracy i finalizacja elementów projektu.

source: Learning the Basics of Photoshop CC for Web Design Beginners
pl: Podstawy Adobe Photoshop CC dla początkujących projektantów stron WWW

source: Understanding the User Interface; Working with Tools and Layers; Creating Shapes; Organizing Layers & Groups; Moving and Resizing Elements; Zooming and Panning Techniques; Using Blend Modes and Adding Effects; Inserting and Styling Text; Designing with Photoshop.
pl: Zrozumienie interfejsu użytkownika; praca z narzędziami i warstwami; tworzenie kształtów; organizacja grup i warstw; przemieszczanie i zmiana rozmiaru elementów; techniki powiększania i przesuwania; tryby mieszania i efekty; wstawianie i stylizacja tekstu; projektowanie w Photoshopie.

source: Get to Know Formats, Resolutions, DPI, and More
pl: Poznaj formaty, rozdzielczości, DPI i inne zagadnienia

source: Screen Basics; Scaling on Devices; Graphic File Formats; Platform Specifics.
pl: Podstawy ekranów; skalowanie na różnych urządzeniach; formaty plików graficznych; specyfika platform.

source: Everything You Need to Know About Adobe XD to Start Designing & Prototyping Awesome Apps
pl: Wszystko, co musisz wiedzieć o Adobe XD, by rozpocząć projektowanie i prototypowanie świetnych aplikacji

source: Basic Tools; Advanced Tools; Designing Assets; Prototyping.
pl: Podstawowe i zaawansowane narzędzia; projektowanie zasobów; prototypowanie.

source: Explore some of the exciting projects I have worked on!
pl: Poznaj ciekawe projekty, nad którymi pracowałem!

source: My Film Say is a learning-focused web application that allows users to explore community opinions on specific movies. The platform fetches movie details such as title, rating, description, and poster via the IMDb API. Users can post their own reviews, rate movies independently, and engage in conversations through comment threads.
pl: My Film Say to aplikacja webowa umożliwiająca użytkownikom poznanie opinii społeczności na temat konkretnych filmów. Szczegóły filmów (tytuł, ocena, opis, plakat) są pobierane za pomocą API IMDb. Użytkownicy mogą publikować własne recenzje, oceniać filmy i brać udział w dyskusjach poprzez system komentarzy.

source: View on GitHub
pl: Zobacz na Github

source: See More
pl: Zobacz Więcej

source: Steam Chest Prices is a web application focused on data analysis of CS2 (Counter-Strike 2) weapon case prices from the Steam Market. It offers historical price charts, percentage change calculations over time, and dynamic value tracking. Users can create accounts to monitor their own collection and gain insights into market trends through visualizations and automated value summaries.
pl: Steam Chest Prices to aplikacja webowa skoncentrowana na analizie danych dotyczących cen skrzynek z bronią w grze CS2 (Counter-Strike 2) na rynku Steam. Oferuje wykresy historycznych cen, obliczenia zmian procentowych w czasie oraz dynamiczne śledzenie wartości. Użytkownicy mogą zakładać konta, aby monitorować własną kolekcję i uzyskiwać wgląd w trendy rynkowe dzięki wizualizacjom oraz automatycznym podsumowaniom wartości.

source: Technical Practice Projects
pl: Projekty ćwiczeniowe

source: A selection of smaller projects developed to enhance my proficiency in Python and gain experience with a variety of technologies. Each project served as a learning opportunity, allowing me to explore new tools, frameworks, and programming paradigms in a practical context.
pl: Zbiór mniejszych projektów stworzonych w celu rozwinięcia umiejętności programowania w Pythonie oraz zdobycia praktycznego doświadczenia z różnymi technologiami. Każdy projekt stanowił okazję do nauki i eksploracji nowych narzędzi, frameworków oraz paradygmatów programowania.

source: Socials
pl: Social media

source: All rights reserved.
pl: Wszelkie prawa zastrzeżone.

source: About Project
pl: O projekcie

source: Technologies behind it and the idea that started it all.
pl: Wykorzystane technologie i motywacja.

source: Home
pl: Strona główna

source: Overview of all available movies.
pl: Podgląd dostępnych filmów.

source: Movie Site
pl: Strona filmu

source: All information about movie and comments
pl: Informacje o filmie i komentarze

source: Add and edit movies
pl: Dodawanie i edycja filmów

source: Adding and editing on a site
pl: Dodawanie i edycja filmów na stronie

source: User Profile
pl: Profil użytkownika

source: Monitoring user activity
pl: Monitorowanie aktywności użytkowników

source: Admin and moderator page
pl: Strona administracji

source: Deleting users and adding roles
pl: Usuwanie użytkowników i nadawanie ról

source: About me and contact
pl: O mnie oraz kontakt

source: Information for other users about author, and contact
pl: Informacje dla użytkowników o autorze i kontakt

source: Comments
pl: Komentarze

source: Comment sections for users opinion
pl: Sekcja komentarzy dla opinii użytkowników

source: Login and Register
pl: Logowanie i rejestracje

source: Login or Register new account
pl: Logowanie i rejestracja nowego konta

source: Idea that started the project
pl: Motywacja do rozpoczęcia projektu

source: I wanted to create a project that would help me develop more practical programming skills. Initially, the idea was based on concepts I had learned during courses, and the website was intended to be a small learning exercise. Over time, it evolved into a more advanced platform as I continued to use it as a workspace for experimenting with new technologies.
pl: Chciałem stworzyć projekt, który pomógłby mi rozwinąć bardziej praktyczne umiejętności programistyczne. Początkowo pomysł opierał się na koncepcjach poznanych podczas kursów, a strona miała być niewielkim ćwiczeniem edukacyjnym. Z czasem przekształciła się w bardziej zaawansowaną platformę, którą wykorzystywałem jako przestrzeń do eksperymentowania z nowymi technologiami.

source: More about the project
pl: Więcej o projekcie

source: Overview
pl: Podgląd

source: is a
pl: jest

source: full-stack web application
pl: aplikacją internetową typu full-stack

source: inspired by platforms like
pl: zainspirowana platformami

source: and
pl: oraz

source: created as part of a personal development initiative to explore web technologies.
pl: stworzona w ramach inicjatywy rozwojowej, mającej na celu zgłębianie technologii webowych.

source: The platform allows users to browse a
pl: Platforma pozwala użytkownikom wyszukiwać

source: curated selection of movies
pl: starannie dobrane filmy

source: with
pl: z

source: interactive poster cards
pl: interaktywnymi kartami filmów

source: that reveal detailed information on hover and a
pl: które pokazują informacje po najechaniu myszką, oraz

source: dynamic carousel
pl: karuzela

source: showcasing random featured films.
pl: przedstawiająca losowo wybrane filmy z bazy danych.

source: Each movie has a dedicated page containing
pl: Każdy film ma dedykowaną podstronę zawierającą

source: key details, ratings, and a comment section
pl: najważniejsze informacje, oraz sekcje komentarzy

source: where registered users can
pl: w której zalogowani użytkownicy mogą

source: engage in discussion
pl: wchodzić w dyskusje

source: reply to other comments, and
pl: odpowiadając na komentarze innych, oraz

source: vote on their usefulness
pl: głosować

source: The project implements a
pl: Projekt posiada

source: role-based access control system
pl: podział na role

source: with three roles:
pl: z trzema dostępnymi rolami:

source: standard user
pl: użytkownik

source: Admins and moderators can
pl: Admin, oraz moderatorzy mogą

source: add, edit, or delete movies
pl: dodawać, edytować, oraz usuwać filmy

source: manage comments,
pl: nadzorować sekcje komentarzy,

source: moderate user profiles
pl: profile użytkowników

source: and assign roles within the platform.
pl: oraz nadawać role innym.

source: All movie data is
pl: Wszystkie dane filmów są

source: fetched from the TMDB API
pl: pobierane z TMDB API

source: to ensure accurate information.
pl: w celu pozyskania dokładnych informacji.

source: The platform integrates
pl: Platforma zawiera

source: authentication
pl: uwierzytelnianie

source: user management
pl: nadzorowanie

source: form handling
pl: obsługę formularzy

source: real-time feedback
pl: informacja zwrotna w czasie rzeczywistym

source: features to deliver a
pl: funkcje umożliwiające dostarczanie

source: responsive and user-friendly experience
pl: responsywnych i przyjaznych dla użytkownika doświadczeń

source: The project serves both as a
pl: Projekt służy zarówno za

source: movie review system
pl: aplikacje do oceniania filmów

source: and a
pl: oraz też

source: learning ground for full-stack development practices
pl: środowisko do nauki tworzenia aplikacji full-stack

source: Technologies used:
pl: Użyte technologie:

source: Database:
pl: Baza danych:

source: Authentication:
pl: Uwierzytelnianie:

source: Forms & Input:
pl: Formularze i dane wejściowe:

source: Data:
pl: Dane:

source: Key Features
pl: Kluczowe funkcje

source: Interactive Movie Cards
pl: Interaktywne karty filmów

source: Flip-style cards showing posters and movie details on hover.
pl: Dwustronne karty pokazujące detale po najechaniu myszką.

source: Random Carousel
pl: Losowa karuzela

source: Dynamic carousel with random movies and key information.
pl: Dynamicznie karuzela z losowymi filmami i kluczowymi informacjami o nich.

source: User Comments
pl: Komentarze użytkowników

source: Add, reply to, and rate comments with upvote and downvote.
pl: Dodawaj, oceniaj i odpowiadaj na komentarze.

source: Role-Based System
pl: Podział na role

source: Admin, moderator, and user roles with different permissions.
pl: Admin, moderator, oraz użytkownicy z różnymi uprawnieniami.

source: User Management
pl: Zarządzanie użytkownikami

source: Admins can manage users, comments, and edit movie data.
pl: Admini mogą zarządzań użytkownikami, komentarzami, oraz edytować filmy.

source: External Data
pl: Zewnętrzne dane

source: Movie details fetched directly from the TMDB API.
pl: Informacje o filmach są pobierane z TMDB API.

source: The homepage serves as the main entry point to the platform, offering an engaging and dynamic presentation of movie content.
pl: Strona główna pełni rolę głównego punktu wejścia do platformy, oferując angażującą i dynamiczną prezentację treści filmowych.

source: It features a
pl: Oferuje

source: carousel
pl: karuzele

source: that displays three randomly selected featured films, each enriched with key information fetched from the
pl: przedstawiającą losowo trzy wybrane filmy z najważniejszymi informacjami, pobranymi z

source: Below the carousel, users are presented with a grid of
pl: Poniżej karuzeli użytkownikom prezentowana jest siatka

source: interactive movie cards
pl: interaktywnych kart filmowych

source: which utilize
pl: które wykorzystują

source: CSS transitions
pl: przejścia CSS

source: to flip on hover, revealing details like title, release year, and rating.
pl: do obrócenia karty po najechaniu na nią myszką, zawiera najważniejsze informacje.

source: Additionally, movies can be
pl: Dodatkowo filmy mogą być

source: sorted
pl: sortowane

source: by various parameters like rating or release year, allowing for easy browsing.
pl: według parametrów: ocena, data wydania, nazwa.

source: The layout is built with
pl: Układ został zbudowany przy użyciu

source: for responsiveness, while
pl: dla zapewnienia responsywności, podczas gdy

source: dynamically manages the content rendering and API data integration to ensure smooth and modern user interaction.
pl: dynamicznie zarządza renderowaniem treści oraz integracją danych z API, aby zapewnić płynną i nowoczesną interakcję z użytkownikiem.

source: A special feature visible only to
pl: Specjalne funkcjonalności dostępne tylko dla

source: moderators
pl: moderatorów

source: admins
pl: adminów

source: is the
pl: to

source: add movie button
pl: przycisk od dodawania filmów

source: enabling them to add new films to the platform with ease.
pl: pozwalający na proste dodawanie nowych filmów na platformę.

source: Provides a comprehensive view of a selected film.
pl: Prezentuje pełne informacje o wybranym tytule.

source: It features the
pl: Zawiera

source: movie poster
pl: plakat filmowy

source: alongside a
pl: wraz z

source: progress circle
pl: okrągły wskaźnik postępu

source: that fills up according to the movie's rating, the percentage value is displayed at the center of the circle, movie details such as the
pl: który wypełnia się zgodnie z oceną filmu, a wartość procentowa jest wyświetlana w centrum okręgu; szczegóły dotyczące filmu, takie jak

source: title
pl: tytuł

source: release year
pl: data premiery

source: genre
pl: gatunek

source: director
pl: reżyser

source: writer
pl: scenarzysta

source: overview
pl: opis

source: retrieved from the
pl: pobrane z

source: and stored in the database.
pl: i zapisane w bazie danych.

source: Additionally, if the user is an
pl: Dodatkowo, jeśli użytkownik jest

source: admin
pl: adminem

source: or
pl: lub

source: moderator
pl: moderatorem

source: they are given the option to
pl: mają możliwość

source: edit
pl: edytowania

source: the movie details.
pl: informacji o filmie.

source: Comment Section
pl: Sekcja komentarzy

source: Allows users to engage with others by leaving feedback on the movie.
pl: Pozwala użytkownikom dzielić się opiniami na temat filmu.

source: Each comment displays the
pl: Każdy komentarz przedstawia

source: author's rating
pl: ocenę osoby komentującej

source: and the
pl: oraz

source: date and time
pl: datę i czas

source: it was posted.
pl: publikacji.

source: Additionally, users can see the
pl: Dodatkowo, użytkownicy widzą

source: upvotes
pl: polubienia

source: downvotes
pl: minusy

source: each comment has received from other logged-in users.
pl: każdego komentarza, zostawione przez zalogowanych użytkowników.

source: Registered users can
pl: Zarejestrowani użytkownicy

source: post comments
pl: zostawiają komentarze

source: rate
pl: ocenę

source: them based on their experience, giving a numerical score that reflects their opinion.
pl: zgodną z ich doświadczeniem, przedstawioną w skali numerycznej 1-10.

source: Users are also able to
pl: Użytkownicy mogą także

source: respond
pl: odpowiadać

source: to other comments, creating a threaded discussion that allows for deeper engagement and conversation.
pl: na komentarze, tworząc dyskusje, która umożliwia głębsze zaangażowanie.

source: This encourages active participation and the sharing of thoughts on the movie.
pl: To zachęca do aktywnego udziału i dzielenia się przemyśleniami na temat filmu.

source: author
pl: Autor

source: of a comment has the ability to
pl: komentarzu ma możliwość

source: delete
pl: usunięcia

source: their own comment at any time, providing control over their contributions.
pl: własnych komentarzy w dowolnym momencie, umożliwiając kontrole nad własnymi wypowiedziami.

source: However,
pl: Jednakże,

source: admins and moderators
pl: admini i moderatorzy

source: have the privilege to
pl: mają przywilej do

source: delete any comment
pl: usuwania wszystkich komentarzy

source: regardless of its author, to maintain the integrity of the platform and ensure the conversation stays respectful.
pl: niezależnie od autora, w celu zachowania integralności platformy i zapewnieniu, ze rozmowa postanie pełna szacunku.

source: Add & Edit Movie
pl: Dodawanie i edycja filmu

source: This section is dedicated to
pl: Ta sekcja jest dedykowana do

source: adding and editing movies
pl: dodawania i edycji filmów

source: in the database and is accessible only to users with
pl: w bazie danych i jest dostępna tylko dla użytkowników z

source: privileges.
pl: przywilejami.

source: The process starts on the
pl: Proces zaczyna się od

source: page, where an authorized user can enter a film title into the search bar.
pl: podstronie, gdzie autoryzowani użytkownicy mogą podać tytuł filmu w wyszukiwarce.

source: A list of matching and similar titles is displayed, allowing the user to
pl: Lista filmów z podobnymi tytułami jest wyświetlana, pozwalając użytkownikom na

source: select the correct movie
pl: wybranie poprawnego filmu

source: from the results.
pl: z wielu wyników.

source: Upon selection, the user is redirected to a shared interface that also serves as the
pl: Po wyborze, użytkownik jest przenoszony do interfejsu, który także służy jako

source: Edit Movie
pl: edycja filmu.

source: page.
pl: strona.

source: Here, a form is pre-filled with all relevant movie data,
pl: Tutaj formularze są wypełnione z najnowszymi danymi,

source: fetched dynamically from the TMDB API
pl: dynamicznie pobranymi z TMDB API
